package src.boj.dfs;

import java.util.*;

// 백준 1012 - 유기농 배추 (실버 2) [재풀이]
// 시간제한: 1초 | 메모리제한: 512MB
//
// 문제: 차세대 영농인 한나는 강원도 고랭지에서 유기농 배추를 재배하기로 하였다.
// 배추를 해충으로부터 보호하기 위해 배추흰지렁이를 구입하기로 결심한다.
// 각 배추에 배추흰지렁이가 한 마리씩 필요한 것이 아니라 인접한 배추들은 한 마리의 지렁이로 보호할 수 있다.
// 인접한 배추란 상하좌우로 연결된 배추를 의미한다.
// 필요한 최소의 배추흰지렁이 마리 수를 구하라.
// 입력: 첫째 줄에 테스트 케이스의 개수 T가 주어진다.
// 각 테스트 케이스의 첫째 줄에는 배추밭의 가로길이 M(1 ≤ M ≤ 50), 세로길이 N(1 ≤ N ≤ 50),
// 배추가 심어져 있는 위치의 개수 K(1 ≤ K ≤ 2500)가 주어진다.
// 그 다음 K줄에는 배추의 위치 X(0 ≤ X ≤ M-1), Y(0 ≤ Y ≤ N-1)가 주어진다.
// 출력: 각 테스트 케이스에 대해 필요한 최소의 배추흰지렁이 마리 수를 출력한다.
//
// 예제 입력:
// 2
// 10 8 17
// 0 0
// 1 0
// 1 1
// 4 2
// 4 3
// 4 5
// 2 4
// 3 4
// 7 4
// 8 4
// 9 4
// 7 5
// 8 5
// 9 5
// 7 6
// 8 6
// 9 6
// 5 3 6
// 0 2
// 1 2
// 2 2
// 3 2
// 4 2
// 4 0
//
// 예제 출력:
// 5
// 2
public class DFS_S2_BOJ1012_2_ING {

    public static void main(String[] args) {

    }
}
