package src.boj;

import java.util.*;

// 백준 13023 - ABCDE (실버 1)
// 시간제한: 2초 | 메모리제한: 512MB
//
// 문제: BOJ 알고리즘 캠프에는 N명의 사람이 참가하고 있다. 사람들은 0번부터 N-1번으로 번호가 매겨져 있고,
// 일부 사람들은 친구이다.
// 다음과 같은 친구 관계가 존재하는지 구해보자.
// A는 B와 친구다. B는 C와 친구다. C는 D와 친구다. D는 E와 친구다.
// 위와 같은 관계(5명이 일렬로 친구)가 존재하면 1, 없으면 0을 출력한다.
// 입력: 첫째 줄에 사람의 수 N (5 ≤ N ≤ 2000)과 친구 관계의 수 M (1 ≤ M ≤ 2000)이 주어진다.
// 둘째 줄부터 M개의 줄에는 정수 a와 b가 주어지며, a와 b가 친구라는 뜻이다.
// 출력: 문제의 조건에 맞는 A, B, C, D, E가 존재하면 1, 없으면 0을 출력한다.
//
// 예제 입력:
// 5 4
// 0 1
// 1 2
// 2 3
// 3 4
//
// 예제 출력:
// 1
public class BOJ13023 {

    public static void main(String[] args) {

    }
}
