package src.boj;

import java.util.*;

// 백준 1260 - DFS와 BFS (실버 2)
// 시간제한: 2초 | 메모리제한: 128MB
//
// 문제: 그래프를 DFS로 탐색한 결과와 BFS로 탐색한 결과를 출력하는 프로그램을 작성하시오.
// 단, 방문할 수 있는 정점이 여러 개인 경우에는 정점 번호가 작은 것을 먼저 방문하고,
// 더 이상 방문할 수 있는 점이 없는 경우 종료한다.
// 입력: 첫째 줄에 정점의 개수 N(1 ≤ N ≤ 1,000), 간선의 개수 M(1 ≤ M ≤ 10,000), 탐색을 시작할 정점의 번호 V가 주어진다.
// 다음 M개의 줄에는 간선이 연결하는 두 정점의 번호가 주어진다.
// 출력: 첫째 줄에 DFS를 수행한 결과를, 그 다음 줄에는 BFS를 수행한 결과를 출력한다.
//
// 예제 입력:
// 4 5 1
// 1 2
// 1 3
// 1 4
// 2 4
// 3 4
//
// 예제 출력:
// 1 2 4 3
// 1 2 3 4
public class DFS_S2_BOJ1260_1_ING {
    // 분석

    public static void main(String[] args) {

    }
}
