package src.boj;

// 백준 11123 - 양 한마리... 양 두마리... (실버 2)
// 시간제한: 1초 | 메모리제한: 256MB
//
// 문제
// 나의 목장은 H x W의 크기의 격자로 이루어져있다. 양을 '#'으로 나타내고 '.'으로 풀을 표현한다.
// 서로 다른 '#' 두 개 이상이 상하좌우로 붙어있다면, 한 무리의 양들이 있는 것이다.
// 나의 양은 몇 개의 무리로 이루어져 있는지 알아내시오.
//
// 입력
// 첫 번째 줄에는 테스트 케이스의 수 T가 주어진다. 각 테스트 케이스의 첫 번째 줄에는 H와 W가 주어진다 (0 < H, W <= 100).
// 이후 H줄에 걸쳐 W개의 문자로 이루어진 문자열이 주어진다.
//
// 출력
// 각 테스트 케이스마다, 양의 무리가 몇 개인지를 한 줄에 출력한다.
//
/* 예제 입력:
2
4 4
#.#.
.#.#
#.#.
.#.#
3 5
#.###
..#..
#.#.#
*/
// 예제 출력:
// 8
// 6

import java.util.*;
public class DFS_S2_BOJ11123_1_ING {

    public static void main(String[] args) {

    }
}
